<template>
  <div>
    <h1>第一课：初识编程</h1>
    <h2>01.技术世界的建筑金字塔——你要成为金字塔顶端的人</h2>
    <img src="https://images.unsplash.com/photo-1616142914433-71120bc70202?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2728&q=80" alt="">
    <p>
      在了解我们为什么需要编程之前，我们先来看看我们的整个技术世界是怎么构建起来了，便于我们对我们的学习的板块和，目前的阶段，以及未来学习的方向有一个比较清晰的认知。
    </p>
    <p>
      首先我们大家一定都对计算机0、1指令、二进制这些词汇不陌生，那么这些看似天书一般的字符是如何被人们组织起来的呢？
    </p>
    <blockquote>
      任何编程语言编写的程序归根到底都是由底层的机器代码（01序列）执行的，无论是编译型语言还是解释型语言。而任何高级编程语言程序的源代码都是一个个字符序列，这个字符序列到底层的01序列是通过编译器或解释器经过多次转换完成的。
    </blockquote>

    <h2>02.为什么学习编程</h2>
    <p>同学们思考一下🥲</p>
    <p>我大概猜测一下同学们的几种结论</p>
    <ul>
      <li>老师非得教我就勉强学习一下</li>
      <li>不知道，没想过，无所谓</li>
      <li>超越专业开发，成为最强码农</li>
    </ul>
    <h2>03.艺术院校同学们学习编程的认知拓宽</h2>
  </div>
</template>
<script>
export default {
  name: 'UnitOne',
  head: {
    title: '第一课：初识编程'
  }
}
</script>
<style>
</style>
